vets_extraction.yml
config:
  target: http://localhost:9966/petclinic/api
  plugins:
    expect: {}
  
  environments:
    load:  
      phases:
        - name: smoke_load_testing
          duration: 5
          arrivalRate: 10
      
    functional:
      phases:
        - name: func_smoke_testing
          duration: 1
          arrivalCount: 1

  payload:
    path: ./test-data/vets-data.csv
    order: sequence           # default: random
    loadAll: true             
    skipHeader: true          # default: false  
    delimiter: ","            # default: ,
    skipEmptyLines: true      # default: true
    fields:
      - "firstName"
      - "lastName"
      - "id"
      - "specialtyName"

scenarios:
- name: petclinic_add_vets
  flow:
  - post:
      url: /vets
      headers:
        Content-Type: application/json
      json:
        firstName: "{{ firstName }}"
        lastName: "{{ lastName }}"
        id: "{{ id }}"
        specialties:
          -
            id: "{{ id }}"
            name: "{{ specialtyName }}"
      capture:
        json: "$.id"
        as: "id"

      expect:
        - matchesRegexp: .+
  - get:
      url: "/vets/{{ id }}"     
      expect:
      - statusCode: 200
      - contentType: json