vets_payload.yml
config:
  target: http://localhost:9966/petclinic/api
  phases:
    - name: smoke_testing
      duration: 1
      arrivalRate: 5
  payload:
    path: ./test-data/vets-data.csv
    order: sequence           # default: random
    loadAll: true             
    skipHeader: true          # default: false  
    delimiter: ","            # default: ,
    skipEmptyLines: true      # default: true
    fields:
      - "firstName"
      - "lastName"
      - "id"
      - "specialtyName"

scenarios:
- name: petclinic_add_vets
  flow:
  - post:
      url: /vets
      headers:
        Content-Type: application/json
      json:
        firstName: "{{ firstName }}"
        lastName: "{{ lastName }}"
        id: "{{ id }}"
        specialties:
          -
            id: "{{ id }}"
            name: "{{ specialtyName }}"